Repository: spbu-se/DesktopAutomataConstructor
Catalog: ControlsLibrary/Properties/Langs/Lang.*.resx
Languages: ru

# addNewTest
source: Add new
ru: Добавить новый

# alreadyDeterministic
source: The automaton is already deterministic
ru: Автомат уже детерминированный

# AutomataConstructor.Name
source: Automata constructor
ru: Конструктор автоматов

# debugString
source: Debug
ru: Отладка

# debugTest
source: Debug
ru: Отладка

# DFA
source: Deterministic finite automaton
ru: Детерминированный конечный автомат

# Editor.TransitionsToolTip
source: Enter transition tokens without any separators
ru: Вводите символы перехода без разделителей

# EpsilonNFA
source: Non-deterministic finite automaton with epsilon-transitions
ru: Недетерминированный конечный автомат с эпсилон-переходами

# Errors.InvalidAutomaton
source: Invalid automaton!
ru: Некорректный автомат!

# Errors.SetAccepting
source: Set accepting state
ru: Выберите принимающее состояние

# Errors.SetInitial
source: Set initial state
ru: Выберите начальное состояние

source: Hide
ru: Скрыть

source: Is accept:
ru: Финальное:

source: Is initial:
ru: Начальное:

# NFA
source: Non-deterministic finite automaton
ru: Недетерминированный конечный автомат

source: No issues found
ru: Ошибок не найдено

source: Open test panel
ru: Открыть тесты

# removeTest
source: Remove
ru: Удалить

# resetDebugString
source: Reset debug
ru: Завершить отладку

# resultDebugString
source: Result:
ru: Результат:

# resultFailed
source: Rejected
ru: Не принята

# resultNotRunned
source: Not runned
ru: Не запущен

# resultPassed
source: Accepted
ru: Принята

# Results.NotDefined
source: Result not defined
ru: Результат не определён

# runAllTests
source: Run all
ru: Запустить все

# runString
source: Run
ru: Запуск

# runTest
source: Run
ru: Запуск

source: Select tool:
ru: Выберите инструмент:

# shouldReject
source: Reject
ru: Отклоняется

# startDebugString
source: Start debug
ru: Начать отладку

# stateName
source: Name:
ru: Имя:

# stepDebugString
source: Step
ru: Шаг

source: String
ru: Строка

# testResult
source: Result
ru: Результат:

# Toolbar.DeleteModeToolTip
source: Click to delete states and transitions (D)
ru: Удаляйте состояния и переходы по клику (D)

# Toolbar.EditModeToolTip
source: Click to place new states and transitions (E)
ru: Размещайте новые состояния и переходы по клику (E)

# Toolbar.SelectModeToolTip
source: Layout states and fill attributes (S)
ru: Размещайте состояние и вводите значения свойств (S)

# Types.FSM
source: Finite state machine
ru: Конечный автомат
